Catalogs/ПричиныВыводаИзОборотаИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПричиныВыводаИзОборотаИСМП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПричины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АннулированиеВыводаИзОборота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлассификаторовВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаПоставляемыхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеВидыПервичныхДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПервичныхДокументовИСМП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОперацийИСМП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПричиныВыводаИзОборотаИСМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Доступные виды первичных документов.
// 
// Параметры:
//  Причина - СправочникСсылка.ПричиныВыводаИзОборотаИСМП - 
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - 
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыПервичныхДокументовИСМП - Доступные виды первичных документов
Функция ДоступныеВидыПервичныхДокументов(Причина, Операция) Экспорт
	
	ДоступныеВидыПервичныхДокументов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПричиныВыводаИзОборотаИСМПДоступныеВидыПервичныхДокументов.ВидДокумента
		|ИЗ
		|	Справочник.ПричиныВыводаИзОборотаИСМП.ДоступныеВидыПервичныхДокументов КАК
		|		ПричиныВыводаИзОборотаИСМПДоступныеВидыПервичныхДокументов
		|ГДЕ
		|	ПричиныВыводаИзОборотаИСМПДоступныеВидыПервичныхДокументов.Ссылка = &Причина
		|	И (ПричиныВыводаИзОборотаИСМПДоступныеВидыПервичныхДокументов.Операция = &Операция
		|	ИЛИ ПричиныВыводаИзОборотаИСМПДоступныеВидыПервичныхДокументов.Операция = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИСМП.ПустаяСсылка)
		|	ИЛИ &Операция = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИСМП.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("Причина", Причина);
	Запрос.УстановитьПараметр("Операция", Операция);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДоступныеВидыПервичныхДокументов.Добавить(Выборка.ВидДокумента);
	КонецЦикла;
	
	Возврат ДоступныеВидыПервичныхДокументов;
	
КонецФункции
	
// Описание причин.
// 
// Возвращаемое значение:
//  Соответствие из ключИЗначение:
//   * Ключ - СправочникСсылка.ПричиныВыводаИзОборотаИСМП - причина вывода из оборота.
//   * Значение - Строка - описание причины.
Функция ОписаниеПричин() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПричиныВыводаИзОборотаИСМП.Ссылка,
		|	ПричиныВыводаИзОборотаИСМП.ОписаниеПричины
		|ИЗ
		|	Справочник.ПричиныВыводаИзОборотаИСМП КАК ПричиныВыводаИзОборотаИСМП";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ОписаниеПричин = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		ОписаниеПричин.Вставить(Выборка.Ссылка, Выборка.ОписаниеПричины);
	КонецЦикла;
	
	Возврат ОписаниеПричин;
КонецФункции
	
#Область ДляВызоваИзДругихПодсистем

// Возвращает реквизиты справочника, которые образуют естественный ключ
// для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - массив имен реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	Результат.Добавить("Идентификатор");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриЗагрузкеКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления) Экспорт
	
	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить(Метаданные.Справочники.ПричиныВыводаИзОборотаИСМП.ПолноеИмя());
	
	Попытка
		Блокировка.Заблокировать();
		ОбновитьПричиныВыводаИзОборотаДаннымиЗагрузки(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления);
		
	Исключение
		ТекстОшибкиПодробно = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		РезультатОбновления.СообщениеОбОшибке = ТекстОшибкиПодробно;
		РезультатОбновления.УспешнаяЗагрузка  = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьПричиныВыводаИзОборотаДаннымиЗагрузки(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления)
	
	Идентификаторы          = ПараметрыЗагрузки.Идентификаторы;
	ДанныеКЗагрузке         = ДанныеКлассификатора.ПричиныВыводаИзОборота;
	ИмяТаблицы              = Метаданные.Справочники.ПричиныВыводаИзОборотаИСМП.ПолноеИмя();
	КонфликтыОбновления     = ПараметрыЗагрузки.КонфликтыОбновления;
	
	ДанныеДляПодбора = Новый ТаблицаЗначений;
	ДанныеДляПодбора.Колонки.Добавить("Имя",           ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ДанныеДляПодбора.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	
	Для каждого СтрокаКЗагрузке Из ДанныеКЗагрузке Цикл
		ЗаполнитьЗначенияСвойств(ДанныеДляПодбора.Добавить(), СтрокаКЗагрузке);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДляПодбора.Имя КАК Наименование,
		|	ДанныеДляПодбора.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ втДанныеДляПодбора
		|ИЗ
		|	&ДанныеДляПодбора КАК ДанныеДляПодбора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДанныеДляПодбора.Наименование КАК Наименование,
		|	втДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	ПричиныВыводаИзОборотаИСМП.Ссылка КАК СсылкаПоИдентификатору,
		|	ПричиныВыводаИзОборотаИСМП.ХешСумма КАК ХешСумма,
		|	ПричиныВыводаИзОборотаИСМП.ХешСуммаПоставляемыхДанных КАК ХешСуммаПоставляемыхДанных
		|ПОМЕСТИТЬ втРезультатыПодбораПоИдентификатору
		|ИЗ
		|	втДанныеДляПодбора КАК втДанныеДляПодбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПричиныВыводаИзОборотаИСМП КАК ПричиныВыводаИзОборотаИСМП
		|		ПО (ПричиныВыводаИзОборотаИСМП.Идентификатор = втДанныеДляПодбора.Идентификатор)
		|ГДЕ
		|	втДанныеДляПодбора.Идентификатор <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПричиныВыводаИзОборотаИСМП.Ссылка КАК СсылкаПоКлючевымПолям,
		|	втДанныеДляПодбора.Наименование КАК Наименование,
		|	втДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	ПричиныВыводаИзОборотаИСМП.ХешСумма КАК ХешСумма,
		|	ПричиныВыводаИзОборотаИСМП.ХешСуммаПоставляемыхДанных КАК ХешСуммаПоставляемыхДанных
		|ПОМЕСТИТЬ втРезультатыПодбораПоКлючевымПолям
		|ИЗ
		|	втДанныеДляПодбора КАК втДанныеДляПодбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПричиныВыводаИзОборотаИСМП КАК ПричиныВыводаИзОборотаИСМП
		|		ПО втДанныеДляПодбора.Наименование = ПричиныВыводаИзОборотаИСМП.Имя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРезультатыПодбораПоКлючевымПолям.Наименование КАК Наименование,
		|	втРезультатыПодбораПоКлючевымПолям.Идентификатор КАК Идентификатор,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(втРезультатыПодбораПоКлючевымПолям.СсылкаПоКлючевымПолям, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору
		|	КОНЕЦ КАК СуществующийОбъектСсылка,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА втРезультатыПодбораПоКлючевымПолям.ХешСумма
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.ХешСумма
		|	КОНЕЦ КАК ХешСумма,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА втРезультатыПодбораПоКлючевымПолям.ХешСуммаПоставляемыхДанных
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.ХешСуммаПоставляемыхДанных
		|	КОНЕЦ КАК ХешСуммаПоставляемыхДанных
		|ИЗ
		|	втРезультатыПодбораПоКлючевымПолям КАК втРезультатыПодбораПоКлючевымПолям
		|		ЛЕВОЕ СОЕДИНЕНИЕ втРезультатыПодбораПоИдентификатору КАК втРезультатыПодбораПоИдентификатору
		|		ПО втРезультатыПодбораПоКлючевымПолям.Идентификатор = втРезультатыПодбораПоИдентификатору.Идентификатор
		|			И втРезультатыПодбораПоКлючевымПолям.Наименование = втРезультатыПодбораПоИдентификатору.Наименование";
	Запрос.УстановитьПараметр("ДанныеДляПодбора", ДанныеДляПодбора);
	
	ПодобранныеДанные = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаДанных Из ДанныеКЗагрузке Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Идентификатор", СтрокаДанных.Идентификатор);
		СтруктураПоиска.Вставить("Наименование", СтрокаДанных.Имя);

		НайденныеСтроки = ПодобранныеДанные.НайтиСтроки(СтруктураПоиска);

		Если НайденныеСтроки.Количество() Тогда
			СтрокаПодобранныхДанных = НайденныеСтроки[0];
		Иначе
			Продолжить;
		КонецЕсли;

		СтрокаИдентификатора = Идентификаторы.Добавить();
		СтрокаИдентификатора.ИмяТаблицы    = ИмяТаблицы;
		СтрокаИдентификатора.Идентификатор = СтрокаДанных.Идентификатор;
		СтрокаИдентификатора.Наименование  = СтрокаДанных.Имя;
		
		Если ПараметрыЗагрузки.ЗагрузкаИзменений И СтрокаДанных.Свойство("Модифицирован") Тогда
			Если Не СтрокаДанных.Модифицирован Тогда
				СтрокаИдентификатора.Ссылка = СтрокаПодобранныхДанных.СуществующийОбъектСсылка;
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		ДальнейшиеДействия = ОбщегоНазначенияИС.ПараметрыОбновленияЭлементовПриЗагрузкеКлассификатора(ПараметрыЗагрузки,
			СтрокаПодобранныхДанных.СуществующийОбъектСсылка, СтрокаПодобранныхДанных.ХешСумма,
			СтрокаПодобранныхДанных.ХешСуммаПоставляемыхДанных, СтрокаДанных.ХешСуммаПоставляемыхДанных);
			
		Если ДальнейшиеДействия.КоллизияИзменений Тогда
			ТекстКоллизии = СтрШаблон(НСтр(
				"ru = 'Невозможно загрузить изменения. Элемент справочника ""%1"" с идентификатором ""%2"" был изменен ранее'"),
				ИмяТаблицы, СтрокаДанных.Идентификатор);
			ВызватьИсключение ТекстКоллизии;
		КонецЕсли;
	
		Если ДальнейшиеДействия.СоздатьЭлемент Тогда
			СуществующийОбъект = СоздатьЭлемент();
		ИначеЕсли ДальнейшиеДействия.ТребуетсяОбновление Тогда
			СуществующийОбъект = СтрокаПодобранныхДанных.СуществующийОбъектСсылка.ПолучитьОбъект();
		Иначе
			СтрокаИдентификатора.Ссылка = СтрокаПодобранныхДанных.СуществующийОбъектСсылка;
		КонецЕсли;

		Если ДальнейшиеДействия.ЗафиксироватьКонфликт Тогда
			ОбщегоНазначенияИС.ДобавитьЭлементДляЗаписиКонфликтаПриОбновлении(
				КонфликтыОбновления, СтрокаПодобранныхДанных.СуществующийОбъектСсылка, СтрокаДанных);
		КонецЕсли;

		Если ДальнейшиеДействия.ТребуетсяОбновление Или ДальнейшиеДействия.СоздатьЭлемент Тогда
			ЗаполнитьЗначенияСвойств(СуществующийОбъект, СтрокаДанных, , "Идентификатор,ХешСуммаПоставляемыхДанных");

			Если Не ЗначениеЗаполнено(СуществующийОбъект.Идентификатор) Тогда
				СуществующийОбъект.Идентификатор = СтрокаДанных.Идентификатор;
			КонецЕсли;

			Если Метаданные.Перечисления.СтатусыКлассификаторовВидовПродукцииИС.ЗначенияПеречисления.Найти(
				СтрокаДанных.Статус) <> Неопределено Тогда
				СуществующийОбъект.Статус = Перечисления.СтатусыКлассификаторовВидовПродукцииИС[СтрокаДанных.Статус];
			КонецЕсли;

			СуществующийОбъект.ДоступныеВидыПервичныхДокументов.Очистить();

			Для Каждого СтрокаПервичногоДокумента Из СтрокаДанных.ДоступныеВидыПервичныхДокументов Цикл
				ВидДокумента = Неопределено;
				Операция     = "";

				Если Метаданные.Перечисления.ВидыПервичныхДокументовИСМП.ЗначенияПеречисления.Найти(
					СтрокаПервичногоДокумента.ВидДокумента) <> Неопределено Тогда
					ВидДокумента = Перечисления.ВидыПервичныхДокументовИСМП[СтрокаПервичногоДокумента.ВидДокумента];
					
					Если ЗначениеЗаполнено(СтрокаПервичногоДокумента.Операция) Тогда
						Если Метаданные.Перечисления.ВидыОперацийИСМП.ЗначенияПеречисления.Найти(
						СтрокаПервичногоДокумента.Операция) <> Неопределено Тогда
							Операция = Перечисления.ВидыОперацийИСМП[СтрокаПервичногоДокумента.Операция];
						Иначе
							Операция = Неопределено;
						КонецЕсли;
					КонецЕсли;

				КонецЕсли;

				Если ВидДокумента = Неопределено Или Операция = Неопределено Тогда
					Если ПараметрыЗагрузки.РежимОтладки Тогда
						ВызватьИсключение НСтр("ru = 'Внутренняя ошибка поиска вида первичных документов ИСМП'");
					Иначе
						РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
						Продолжить;
					КонецЕсли;
				КонецЕсли;

				СтрокаПервичныхДокументов = СуществующийОбъект.ДоступныеВидыПервичныхДокументов.Вставить(
					СтрокаПервичногоДокумента.НомерСтроки - 1);
				СтрокаПервичныхДокументов.ВидДокумента = ВидДокумента;
				СтрокаПервичныхДокументов.Операция     = Операция;

			КонецЦикла;

			СуществующийОбъект.ХешСумма = СтрокаДанных.ХешСуммаПоставляемыхДанных;

			Если Не ПараметрыЗагрузки.ЗагрузкаИзменений Тогда
				СуществующийОбъект.ХешСуммаПоставляемыхДанных = СтрокаДанных.ХешСуммаПоставляемыхДанных;
			КонецЕсли;

			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СуществующийОбъект);

			СтрокаИдентификатора.Ссылка = СуществующийОбъект.Ссылка;

		КонецЕсли;

	КонецЦикла;
	
	Если ПараметрыЗагрузки.ЗагрузкаИзменений Тогда
		ИдентификаторыПоТипу = Идентификаторы.Скопировать(Новый Структура("ИмяТаблицы", ИмяТаблицы), "Наименование,Идентификатор");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИдентификаторов.Наименование КАК Наименование,
		|	ТаблицаИдентификаторов.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ ВтИдентификаторы
		|ИЗ
		|	&ТаблицаИдентификаторов КАК ТаблицаИдентификаторов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПричиныВыводаИзОборотаИСМП.Ссылка КАК Ссылка,
		|	ПричиныВыводаИзОборотаИСМП.Идентификатор КАК Идентификатор,
		|	ПричиныВыводаИзОборотаИСМП.Имя КАК Наименование
		|ИЗ
		|	Справочник.ПричиныВыводаИзОборотаИСМП КАК ПричиныВыводаИзОборотаИСМП
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтИдентификаторы КАК ВтИдентификаторы
		|		ПО ПричиныВыводаИзОборотаИСМП.Идентификатор = ВтИдентификаторы.Идентификатор
		|			И ПричиныВыводаИзОборотаИСМП.Имя = ВтИдентификаторы.Наименование
		|ГДЕ
		|	ВтИдентификаторы.Наименование ЕСТЬ NULL
		|	И ВтИдентификаторы.Идентификатор ЕСТЬ NULL";
		Запрос.УстановитьПараметр("ТаблицаИдентификаторов", ИдентификаторыПоТипу);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаИдентификатора = Идентификаторы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаИдентификатора, ВыборкаДетальныеЗаписи);
			
			СтрокаИдентификатора.ИмяТаблицы = ИмяТаблицы;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Функция ИнициализироватьПараметрыОбновления() Экспорт

    СтруктураДанныхОбновления = Новый Структура;

	СтруктураДанныхОбновления.Вставить("Наименование",                     "");
	СтруктураДанныхОбновления.Вставить("Имя",                              "");
	СтруктураДанныхОбновления.Вставить("ОписаниеПричины",                  "");
	СтруктураДанныхОбновления.Вставить("АннулированиеВыводаИзОборота",     Ложь);
	СтруктураДанныхОбновления.Вставить("Идентификатор",                    "");
	СтруктураДанныхОбновления.Вставить("Статус",                           "");
	СтруктураДанныхОбновления.Вставить("ДоступныеВидыПервичныхДокументов", Новый Массив);
	СтруктураДанныхОбновления.Вставить("ХешСуммаПоставляемыхДанных",       "");	

	Возврат СтруктураДанныхОбновления;
	
КонецФункции

#КонецОбласти

#КонецЕсли
